Project-Waterwise/app/Models/ModelPengguna.php

    public function getTop10Leaderboard()
    {
        return $this->where('userlevel', 'user')
                    ->orderBy('ecopoints', 'DESC')
                    ->limit(10)
                    ->findAll();
---
SELECT *
FROM `pengguna`
WHERE `userlevel` = 'user'
ORDER BY `ecopoints` DESC
 LIMIT 10