Project-Waterwise/app/Controllers/Auth.php

SELECT *
FROM `pengguna`
WHERE `username` = 'engkusyahmi'
 LIMIT 1
---
    public function loginPost()
    {
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $modelpengguna = new ModelPengguna();
        $data = $modelpengguna->where("username", $username)->first();