Project-Waterwise/app/Controllers/User.php

    public function dashboard()
    {
        // Security check - ensure only users can access this page
        if (session()->get('userlevel') !== 'user') {
            return redirect()->to('/');
        }

        // Additional security - check if user is logged in
        if (!session()->has('id')) {
            return redirect()->to('/login');
        }

        // Initialize variables and database connections
        $userId = session()->get('id');
        $model = new ModelPengguna();
        $db = \Config\Database::connect();

        // Set timezone to Malaysia and get current date
        $now = new \DateTime('now', new \DateTimeZone('Asia/Kuala_Lumpur'));
        $today = $now->format('Y-m-d');

        // Check if user has already claimed daily reward today
        $hasClaimed = $db->table('daily_logins')
            ->where('user_id', $userId)
            ->where('login_date', $today)
            ->countAllResults() > 0;

        // Get user data and login streak information
        $userData = $model->find($userId);
---
SELECT COUNT(*) AS `numrows`
FROM `daily_logins`
WHERE `user_id` = '1'
AND `login_date` = '2025-07-11'
SELECT *
FROM `pengguna`
WHERE `pengguna`.`id` = '1'

        $nextClaimCountdown = gmdate('H:i:s', $secondsRemaining);

        // Get list of completed tasks for this user
        $completedTasks = $db->table('user_tasks')
            ->select('task_key')
            ->where('user_id', $userId)
            ->get()
            ->getResultArray();
---
SELECT `task_key`
FROM `user_tasks`
WHERE `user_id` = '1'

        // ✨ NEW: GET ACTIVE QUESTS FOR DASHBOARD DISPLAY
        // This joins user_quests with quests table to get complete quest information
        // Only fetches quests with 'pending' status (accepted but not completed)
        $activeQuests = $db->table('user_quests uq')
            ->select('uq.*, q.title, q.description, q.ecopoints_reward, q.xp_reward, q.type')
            ->join('quests q', 'q.id = uq.quest_id')
            ->where('uq.user_id', $userId)
            ->where('uq.status', 'pending')
            ->get()
            ->getResult();
---
SELECT `uq`.*, `q`.`title`, `q`.`description`, `q`.`ecopoints_reward`, `q`.`xp_reward`, `q`.`type`
FROM `user_quests` `uq`
JOIN `quests` `q` ON `q`.`id` = `uq`.`quest_id`
WHERE `uq`.`user_id` = '1'
AND `uq`.`status` = 'pending'

    public function claimDailyReward()
    {
        // Security check - ensure only users can claim rewards
        if (session()->get('userlevel') !== 'user') {
            return redirect()->to('/');
        }

        // Initialize variables and get current date
        $userId = session()->get('id');
        $db = \Config\Database::connect();
        $now = new \DateTime('now', new \DateTimeZone('Asia/Kuala_Lumpur'));
        $today = $now->format('Y-m-d');

        $model = new ModelPengguna();
        $user = $model->find($userId);

        // Check if user has already claimed today's reward
        $alreadyClaimed = $db->table('daily_logins')
            ->where('user_id', $userId)
            ->where('login_date', $today)
            ->countAllResults();
---
SELECT *
FROM `pengguna`
WHERE `pengguna`.`id` = '1'
SELECT COUNT(*) AS `numrows`
FROM `daily_logins`
WHERE `user_id` = '1'
AND `login_date` = '2025-12-18'

        }

        // Record the daily login
        $db->table('daily_logins')->insert([
            'user_id' => $userId,
            'login_date' => $today
        ]);
---
INSERT INTO `daily_logins` (`user_id`, `login_date`) VALUES ('1', '2025-12-18')


        // Mark daily login task as completed (ignore if already exists)
        try {
            $db->table('user_tasks')->insert([
                'user_id' => $userId,
                'task_key' => 'daily_login'
            ]);
---
INSERT INTO `user_tasks` (`user_id`, `task_key`) VALUES ('1', 'daily_login')

    public function quest()
    {
        // Security check
        if (session()->get('userlevel') !== 'user') {
            return redirect()->to('/');
        }

        $userId = session()->get('id');
        $db = \Config\Database::connect();

        // Get all available quests from database
        $allQuests = $db->table('quests')->get()->getResult();

        // Get user's quest progress and status
        $userQuests = $db->table('user_quests')
            ->where('user_id', $userId)
            ->get()
            ->getResult();
---
SELECT *
FROM `quests`
SELECT *
FROM `user_quests`
WHERE `user_id` = '1'