Project-DriveNRent/app/Models/MessageModel.php

SELECT COUNT(*) AS `numrows`
FROM `message`
WHERE `receiver_id` = '3'
AND `is_read` = 0
---
    public function getUnreadCount($userId)
    {
        return $this->where('receiver_id', $userId)
                    ->where('is_read', 0)
                    ->countAllResults();