Project-DriveNRent/app/Controllers/AdminController.php

SELECT COUNT(*) AS `numrows`
FROM `bookings`
SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE `status` = 'approved'
SELECT *
FROM `bookings`
ORDER BY `created_at` DESC
 LIMIT 5
---
    public function index()
    {
        // Check admin access
        if (!session()->has("userlevel") || session()->get("userlevel") !== "admin") {
            return redirect()->to(base_url('login'))->with('error', 'Only for admin access');
        }

        // Dashboard statistics
        $totalCars        = $this->busModel->countAllResults();
        $totalBookings    = $this->bookingModel->countAllResults();
        $pendingBookings  = $this->bookingModel->where('status', 'pending')->countAllResults();
        $approvedBookings = $this->bookingModel->where('status', 'approved')->countAllResults();

        // Recent bookings
        $recentActivity = $this->bookingModel->orderBy('created_at', 'DESC')->findAll(5);