Project-DriveNRent/app/Controllers/Auth.php

SELECT *
FROM `pengguna`
WHERE `username` = 'Fahim'
 LIMIT 1
---
   public function authenticate()
{
    $request = service('request');
    $session = session();

    $username = $request->getPost('user');
    $password = $request->getPost('p');

    $model = new ModelPengguna();
    $user = $model->where('username', $username)->first();