Project-DriveNRent/app/Controllers/Home.php

    public function dashboard()
{
    $userModel = new \App\Models\ModelPengguna();
    $bookingModel = new \App\Models\ModelBooking();

    // Count users by role
    $totalDriver = $userModel->where('userlevel', 'driver')->countAllResults();
    $totalAdmin = $userModel->where('userlevel', 'admin')->countAllResults();
    $totalStudent = $userModel->where('userlevel', 'student')->countAllResults();

    // Booking stats
    $totalBookings = $bookingModel->countAllResults();
    $approvedBookings = $bookingModel->where('status', 'approved')->countAllResults();
    $pendingBookings = $bookingModel->where('status', 'pending')->countAllResults();

    // Recent activity
    $recentActivity = $bookingModel->orderBy('created_at', 'DESC')->findAll(5);

    // Monthly stats
    $monthlyData = $bookingModel->select("MONTHNAME(created_at) as month, COUNT(*) as total,
                                          SUM(CASE WHEN status = 'approved' THEN 1 ELSE 0 END) as approved")
                                ->groupBy("MONTH(created_at)")
                                ->orderBy("MIN(created_at)", "ASC")
                                ->findAll();
---
SELECT COUNT(*) AS `numrows`
FROM `pengguna`
WHERE `userlevel` = 'driver'
SELECT COUNT(*) AS `numrows`
FROM `pengguna`
WHERE `userlevel` = 'admin'
SELECT COUNT(*) AS `numrows`
FROM `pengguna`
WHERE `userlevel` = 'student'
SELECT COUNT(*) AS `numrows`
FROM `bookings`
SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE `status` = 'approved'
SELECT COUNT(*) AS `numrows`
FROM `bookings`
WHERE `status` = 'pending'
SELECT *
FROM `bookings`
ORDER BY `created_at` DESC
 LIMIT 5
SELECT MONTHNAME(created_at) as month, COUNT(*) as total, SUM(CASE WHEN status = 'approved' THEN 1 ELSE 0 END) as approved
FROM `bookings`
GROUP BY MONTH(created_at)
ORDER BY MIN(created_at) ASC